garyPenhook/PyAvrOCD/svd/avr32du28.svd
        <register>
          <name>MUXPOS</name>
          <description>Positive mux input</description>
          <addressOffset>0xB</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MUXPOS</name>
              <description>Analog Channel Selection Bits</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AIN0</name>
                  <description>ADC input pin 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN1</name>
                  <description>ADC input pin 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN2</name>
                  <description>ADC input pin 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN3</name>
                  <description>ADC input pin 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN4</name>
                  <description>ADC input pin 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN5</name>
                  <description>ADC input pin 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN6</name>
                  <description>ADC input pin 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN7</name>
                  <description>ADC input pin 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN16</name>
                  <description>ADC input pin 16</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN17</name>
                  <description>ADC input pin 17</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN18</name>
                  <description>ADC input pin 18</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN19</name>
                  <description>ADC input pin 19</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN20</name>
                  <description>ADC input pin 20</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN21</name>
                  <description>ADC input pin 21</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN22</name>
                  <description>ADC input pin 22</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN23</name>
                  <description>ADC input pin 23</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN24</name>
                  <description>ADC input pin 24</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN25</name>
                  <description>ADC input pin 25</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN26</name>
                  <description>ADC input pin 26</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN27</name>
                  <description>ADC input pin 27</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN31</name>
                  <description>ADC input pin 31</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GND</name>
                  <description>Ground</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEMPSENSE</name>
                  <description>Temperature sensor</description>
                  <value>66</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDDIV10</name>
                  <description>VDD/10</description>
                  <value>68</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DACREF0</name>
                  <description>AC0 DAC voltage</description>
                  <value>73</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT</name>
          <description>ADC Accumulator Result</description>
          <addressOffset>0xC</addressOffset>
          <size>0x10</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RESULT</name>
              <description>ADC Result</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SAMPLE</name>
          <description>ADC Sample</description>
          <addressOffset>0xE</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SAMPLE</name>
              <description>ADC Sample</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x8</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ADCBUSY</name>
              <description>ADC Busy</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMP</name>
          <description>Temporary Data</description>
          <addressOffset>0x14</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TEMP</name>
              <description>Temporary</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>WINHT</name>
          <description>Window comparator high threshold</description>
          <addressOffset>0x12</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WINHT</name>
              <description>Window High Threshold</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>WINLT</name>
          <description>Window comparator low threshold</description>
          <addressOffset>0x10</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WINLT</name>
              <description>Window Low Threshold</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
